---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericWarning
source: html/f7ed0942-db6f-9c14-6f70-4f154f6658ea.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericWarning Property

A generic error has occurred.

## Syntax (C#)
```csharp
public static FailureDefinitionId GenericWarning { get; }
```